blog/2018-11-01.html
<!DOCTYPE html>
<html>
<head>
<title>2019年の準備</title>
<!-- 2018-11-02 Fri 06:30 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="/css/prelude.css" />
<link rel="stylesheet" type="text/css" href="/css/highlight.css" />
</head>
<body>
<div id="content">
<h1 class="title">2019年の準備</h1>
<div class="location">
<p>
https://<a href="/">bydriv.github.io</a>/<a href="/blog">blog</a>/<strong>2018-11-01.html</strong>
</p>

</div>

<div class="created_at">
<p>
created at <time datetime="2018-11-01">2018-11-01</time>
</p>

</div>

<div class="updated_at">
<p>
updated at <time datetime="2018-11-01">2018-11-01</time>
</p>

</div>

<p>
今日は2018年11月1日．
昨日は2018年10月31日，ハロウィンでした．
ところでハロウィンというのはもともとはケルトの祭日らしい．
ケルトの文化では11月1日が元日で， 10月31日というのは大晦日にあたる日だったそうです．
というわけで， 新年あけましておめでとうございます (？)．
</p>

<p>
2019年の準備をそろそろ始めないとなァ，と思っていたところだったのですけど，
ちょうど11月1日がケルトでは元日とされるらしいので，
もう新年を迎えたつもりで，新年の抱負みたいなことをしてゆきたいと思います．
</p>

<p>
今年やったことなどは <a href="./2018-10.html">2018-9, 2018-10 の進捗まとめ</a> に書いたのですけど，
2019年やりたいこととしては，まだ書いていない．
書く必要あるのか，というのもあるけど，
いちおう書くことでキモチをしっかりさせるみたいな効果はあります．
なので書いてゆこうと思う．
</p>

<p>
2019年にやりたいことのひとつはゲーム開発．
今年もいちおう小さなゲームならつくれたけど，
まァ満足できたとはいえない．
</p>

<p>
もうひとつやりたいのはコンパイラというか，言語開発．
これはうん，どういう路線にするのかいまでも迷っているみたいなのがある．
</p>

<p>
最近は計算複雑性理論や計算可能性理論に興味がある．
計算複雑性理論というのは，大雑把にいえば <b>ある問題を解くのに，どれくらい複雑な計算が必要か</b>
考えるというもの． ここでいう複雑さというのは，大別すれば <b>時間計算量</b> と <b>空間計算量</b> のふたつ．
時間計算量というのは <b>ある問題を解くのに，どれくらい時間が必要か</b> ということで，
空間計算量というのは， <b>ある問題を解くのに，どれくらいメモリが必要か</b> ということ．
</p>

<p>
関数型言語の型システムはすきなのだけれど，
こういった計算複雑性についてはナイーブなところがあると感じている．
たとえば， 配列の添え字アクセス <code>xs[n]</code> は O(1) なのに対し，
リストの添え字アクセス <code>nth(xs, n)</code> は O(n) なのに，
関数型言語のたいていの型システムではこれらが同じ型とされてしまう
(たとえば型クラスの制約として計算量が O(1) であることを要求したりできない)．
</p>

<p>
いまわたしが関心があるのは，そういった計算量の考えかたを型システムに盛りこむこと．
といっても，簡単にはできそうにもないのでどうしようかなァ，
みたいなことを考えている．
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">言語開発</h2>
<div class="outline-text-2" id="text-1">
<p>
計算複雑性理論の複雑性クラスを参考にしたいと思っている．
たとえば， <b>RE</b> (帰納的可算言語のクラス) と
<b>PR</b> (原始再帰関数のクラス)
を型によって区別できる，など．
構文はテキトウなのだがこんな感じ:
</p>

<pre class="example">
val f : Int -&gt; PR Int
val g : Int -&gt; RE Int
</pre>

<p>
<b>PR</b> ⊆ <b>RE</b> だから，
</p>

<pre class="example">
val RE : PR a -&gt; RE a
</pre>

<p>
は認めてよい． <code>RE a -&gt; PR a</code> は実装(証明)できない．
</p>

<p>
推論規則をどうすればいいのか？
それはよくわかっていない．
ひとつヒントはあり，
<code>for</code> ループで書けるプログラムは <b>PR</b> (原始再帰関数) で書けるプログラムと厳密に等しい
(実際，それを根拠に実装された言語として <a href="https://en.wikipedia.org/wiki/LOOP_(programming_language)">https://en.wikipedia.org/wiki/LOOP_(programming_language)</a> などがある)
から，
</p>

<pre class="example">
i : PR int    n : PR int    m : PR int    x : PR unit
_____________________________________________________
         for i = n to m do x done : PR unit
</pre>

<p>
というふうにすることができる．
</p>

<p>
チューリングマシンが認識する言語は帰納的可算言語というらしい．
複雑性クラスでは <b>RE</b> と呼ばれる．
つまりわれわれが <b>RE</b> で表したいのはチューリング完全な関数だから，
<code>while</code> は認めてもよかろう:
</p>

<pre class="example">
 x : RE bool    y : RE unit
___________________________
while x do y done : RE unit
</pre>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">そもそもこういうふうに区別する意義はあるのか</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>PR</b> や <b>RE</b> を区別したい第一の意義は，
<b>PR</b> の関数はすべて全域関数だが <b>RE</b> の関数は部分関数である可能性があるということ．
</p>

<p>
全域関数と部分関数を区別したい，という需要はあると思うのだけど，
最近はチューリング完全な体系でそれをやるのはナンセンスというキモチがある．
なぜかというと，チューリング完全な体系というのはすべての計算可能関数が書けるのだが，
計算可能関数というのは定義的に自然数から自然数への部分関数なので，
チューリング完全な体系で部分関数を追放するのは土台無理な話なのである．
</p>

<p>
だが， <b>部分関数ではなく，全域関数だけを書きたい</b> というキモチはある．
さてどうするか．
</p>

<p>
まず問題になってくるのは，全域関数かどうか判定することだがこれは停止性問題があるので難しい．
パターンマッチを網羅どうのという話ではなく， たとえば(構文はテキトウだが)
</p>

<pre class="example">
fun head (x :: _) = x
  | head nil = head nil
</pre>

<p>
とかされたらわれわれにはどうしようもない．
例外ではなく無限ループをするようにすれば，
チューリング完全な言語なら部分関数は書けてしまうワケです．
こう言い換えてもいい．
<b>チューリング完全ならば，部分関数も書ける</b>
もしくは <b>チューリング完全の定義には，部分関数も含まれる</b> なんてね．
</p>

<p>
となると，部分関数を排除する試み(すくなくともコーディング規約のようなものではなく，
チャンと部分関数が書けない言語を設計するならば)チューリング完全性も捨てることになる．
</p>

<p>
……というのは言いすぎで，チューリング完全な必要があるならチューリング完全に，
ないならもうちょっと制約の強い体系で書けてもいいんじゃないの，
ということです．
それが <b>RE</b> と <b>PR</b> の意図するところで，
<b>RE</b> は <b>チューリング完全かつ部分関数</b> を書くもので，
<b>PR</b> は <b>チューリング不完全かつ全域関数</b> を書くもの．
<code>main</code> 関数は <code>val main : RE unit</code> とか型をつける．
<code>val head : list a -&gt; PR (option a)</code>  とかそんな．
</p>

<p>
<b>PR</b> は全域関数というより原始再帰関数のクラスで，
原始再帰関数はすべて全域関数だし，
日常的に必要な関数のほとんどはこれで書ける．
ただし，全域関数がすべて原始再帰関数というわけではない(たとえばアッカーマン関数などがある)ので，
<code>val head : list a -&gt; total (option a)</code> とか
<code>val main : partial unit</code> とかするのは避けている．
(<b>PR</b> は <code>for</code> の推論規則で原始再帰関数だけを書けることが保証できるが，
<code>total</code> みたいなタグをつけてすべての全域関数が書ける言語を設計するのは，たぶんかなり難しいし，
その労力に見合わないと思う)．
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">参照</h3>
<div class="outline-text-3" id="text-1-2">
<p>
実際のところマジメな話，参照はあったほうが楽というのが本音だと思う．
無理に関数型プログラミングするより参照を使ったほうが楽という場合は多い．
わたしは関数型であれ手続き型であれ楽な方法を選びたい．
ただ参照を言語に加えるならかなり慎重にならないといけないのはまちがいない．
</p>

<p>
参照を考えるうえで厄介なのは参照が再帰をするために使えるという事実で，
たとえば
</p>

<pre class="example">
let
  val f : ref (int -&gt; int) = ref (fn x =&gt; x)
  val fib : int -&gt; int = fn x =&gt;
    if x = 0 then 0
    else if x = 1 then 1
    else !f (x - 2) + !f (x - 1)
in
  f := fib
end
</pre>

<p>
のようにすることで <code>fib</code> の定義内で <code>fib</code> 自身を参照することができるため再帰ができてしまう．
多相性とかも関係ないので Relaxing the Value Restriction みたいなのでは解決できない．
そもそも Value Restriction にすらひっかからない．
</p>

<p>
この点についても <a href="https://en.wikipedia.org/wiki/LOOP_(programming_language)">https://en.wikipedia.org/wiki/LOOP_(programming_language)</a> を参考にしてみると，
LOOP には参照というか変数はあることがわかる．
ただし，この変数は数値のみ格納できる．
とはいえ， 数値ではなく文字列にしても問題はなさそうだし，
代数的データ型を格納しても問題なかろう．
</p>

<p>
ということで，関数の参照はつくれない，というふうに制限することを考えている．
すくなくとも関数の参照をつくった時点でチューリング完全になることはまちがいないので，
関数の参照を扱えるとしても <b>RE</b> のみで，
<b>PR</b> では関数の参照は扱えないべきである．
</p>

<p>
配列のような mutable な構造も同様の問題があるので，
やはり関数の配列のようなものはすくなくとも <b>PR</b> ではつくれないようにすべきだろう．
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">再帰型</h3>
<div class="outline-text-3" id="text-1-3">
<p>
再帰型は recursive types for free! という論文にある通り covariant の位置でのみ許すようにする．
すくなくとも <b>PR</b> では covariant の位置でのみ再帰できて，
<b>RE</b> では contravariant でも再帰できる，というふうにする．
</p>

<p>
もっと単純に，関数の再帰型はつくれないとしてもいい．
contravariant な型変数が出現するのは関数のみなので，これでも同様の効果が得られる．
関数のポインタがつくれない，関数の再帰型はできないとしたほうがおそらくプログラマにとっては理解が直観的だと思われる．
hungry function のようなものは書けなくなるが，
実用上はあまり問題はないだろう．
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">再帰</h3>
<div class="outline-text-3" id="text-1-4">
<p>
再帰自体はできたほうが便利で， Coq みたいに値の構造による帰納法的なものができたらいいかもしれない．
まだあまり詰められていない．
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">もっと細かい複雑性クラスを扱えるようにするか</h3>
<div class="outline-text-3" id="text-1-5">
<p>
そもそも <b>PR</b> と <b>RE</b> を区別できるような言語をつくろう，
というのは， <code>for</code> や <code>while</code> で書けるプログラムの集合が <b>PR</b> や <b>RE</b> になるから，
<b>PR</b> しか書けないようにするには <code>for</code> しか書けないようにすればいいだけなので実装が簡単だから．
<b>DTIME</b> とか <b>EXPTIME</b> を区別できるようにするには，
<b>どういう推論規則で検査すればEXPTIMEしか書けないと保証できるか</b> ということがわからないので，
まだ考えていない．
</p>

<p>
たとえば <code>for</code> すら使わないなら定数時間，みたいなことはできるんじゃない？
みたいなことはなんか思ってる．
ただ，理論的な下地がなければ自信がでない感はある．
</p>

<p>
<b>PR</b> や <b>RE</b> 以外のクラスを扱えるようにするなら，まずは定数時間を扱えるようにしたい……のだけど，
定数時間を扱う複雑性クラスに名前がついているのか知らない（あるのか？）ので，
便宜的に <b>K</b> で表すことにする．
そうすると
</p>

<pre class="example">
(* 配列のランダムアクセス *)
val sub : array a -&gt; int -&gt; K a
</pre>

<p>
というふうになる．
明らかに <b>K</b> ⊆ <b>PR</b> だから，
</p>

<pre class="example">
val PR : K a -&gt; PR a
</pre>

<p>
は認めてよい．
</p>

<p>
定数時間の関数 (終域に <b>K</b> がついた関数のみに依存する関数) はやはり定数時間で終了すると期待されるので，
推論規則もそんなに難しくはならないだろう．
</p>

<p>
リテラルは <b>K</b> をつけるといいかもしれない．
</p>

<p>
<code>for</code> や <code>while</code> は当然書けないし，それらを使った関数も書けない．
</p>

<p>
<i>Note</i>: <b>K</b> がついた関数やデータは設定記述言語に適していると思われる．
</p>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">ホーア論理について</h3>
<div class="outline-text-3" id="text-1-6">
<p>
計算複雑性とは関係ないのだけど，ホーア論理みたいなものも採用したい気がしている．
</p>

<p>
理由はいくつかあるのだけど，大きな理由は多重チェックを避けるため．
</p>

<p>
よくあるパターンとしてある値が特定の条件を満たすこと (null でないとか， 空でないとか)
をある関数内でチェックしているのにもかかわらずさらにその関数の呼び出し側でチェックするということがある．
</p>

<pre class="example">
fun f xs =
  if null xs then
    raise &lt;..&gt;
  else
    &lt;..&gt;

fun g xs =
  if null xs then
    raise &lt;..&gt;
  else let
    val y = f xs
  in
    &lt;..&gt;
  end
</pre>

<p>
こういうことをしてしまう場合はほんとに多く，
オーバーヘッドは無視できる程度だとしてコードのあちこちでチェックしているのでとにかく見通しが悪いうえ，
どのチェックをはぶいても問題ないのかが自明ではない (のでバグりやすい)．
</p>

<p>
こういうコードは少ないときはいいけど，どこではぶいてよいのかわからないのでとにかく片っ端からあちこちに
書く戦略になりやすく，そうすると当然のことながらコードのあちこちに同じような条件が大量に書かれていてアレ．
</p>

<p>
そうではなくホーア論理的なもので事前条件と事後条件をこう書きたい．
</p>

<pre class="example">
fun f xs = {
  xs /= nil
} &lt;..&gt; {
  xs /= nil
}

fun g xs ={
  xs /= nil
} let
  val y = f xs
in
  &lt;..&gt;
end {
  xs /= nil
}
</pre>

<p>
こうすれば条件部を機械的に検査することも可能になるし，
引数が満たすべき条件が明示されていて読みやすく(効用には個人差があります)，
コード生成も工夫すれば条件のチェックをひとつにまとめられるはず．
</p>

<p>
さらに条件も型に含めることが可能になる．
</p>

<pre class="example">
val f : (xs:list a) -&gt; {xs /= nil} &lt;..&gt; {xs /= nil}
val g : (xs:list a) -&gt; {xs /= nil} &lt;..&gt; {xs /= nil}
</pre>

<p>
ドキュメントとして関数の事前条件と事後条件が明示されるのは単純にうれしい．
あと， シンプルに事前条件を満たさずに呼びだせばコンパイル時にチェックすることもできる．
</p>

<pre class="example">
fun h xs = {} g xs {} (* 事前条件の不一致でエラーが報告される *)

(* 事前条件を ``にぎりつぶす'' 場合． *)
fun h xs = {
} case xs of
    nil =&gt;
      NONE
  | _ :: _ =&gt;
      SOME (g xs) (* xs /= nil であることは，処理系によって推論される *)
{
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">ゲーム開発</h2>
<div class="outline-text-2" id="text-2">
<p>
話は変わるけどゲーム開発をしたいみたいなキモチはいまでもある．
</p>

<p>
ゲームは，いちおういまできてるものはいまできてるものでよくて，
これからつぎのゲームを開発したい．
</p>

<p>
1作めは今年開発したのでよくて， 2作めという感じ(？)．
</p>

<p>
このへんはもうちょっと計画を練らないとなァという感じです．
</p>

<p>
とりあえず，なにがボトルネックになっているかを明らかにしたいけど，
短期間でゲームをつくっちゃうひととか見てると，
やっぱ <b>そのゲームをプレイして，なにが楽しいのか</b> をちゃんと伝えれるひとが強いみたいな感じがある．
</p>

<p>
たぶんかけた時間とか労力みたいなのはあんま関係なくて，
<b>これはこれこれこういうことをするゲームです</b> ということを説明できるといいんじゃないかという感じがある．
プレイヤーにそのゲームを遊ぶ動機をつけさせるというか．
</p>

<p>
たぶんシステムから考えてるのがよくなくて，
プレイヤーの視点というか自分だったらどういうゲームが遊びたいの？
みたいなのが抜けてる感がある．
</p>

<p>
プレイヤーがゲームを遊ぶ目的ってジャンルによって異なるけど，
たとえば格ゲーなら対戦相手を倒すことだったり，
RPGだったらストーリーを進めるためだったりする．
でもRPGで雑魚敵を倒すことを目的にして遊ぶひとってあんまいないよね．
みたいなことを考えると，やっぱプレイヤーが遊ぶ動機になる要素を重点的に開発して，
遊ぶ動機になりにくい部分はあとまわしにしたほうがいいのかなぁとか．
</p>

<p>
もちろんジャンルみたいな考えかたに縛られる必要はなくてそのゲームでなにがおもしろいのかを伝えられればいいんだけど，
わたしのゲームはまだ伝える力に乏しいというか，まだなにがおもしろいのかを自分でもよくわからずに開発している気がする．
</p>

<p>
すくなくとも，雑魚敵を倒して楽しいゲームにしたくはないしするつもりもなくて，
ストーリーを進めたりマップを攻略するのが楽しいゲームにしたいわけです．
</p>

<p>
そう考えると，やっぱ今後の課題として <b>遊びごたえのあるマップデザイン</b> みたいなのがあるのかなァ，
とか． マップデザインが完全に素人なのがボトルネックになっているのかもしれない．
</p>

<p>
ストーリーはなんか，大雑把な方針として研究員の手記みたいなのを集めることで間接的に想像できるようにするというか，
そんな感じにしたいとかなんとか思っている．
</p>

<p>
まあともかくそんな感じ．
</p>
</div>
</div>
</div>
</body>
</html>
